# 教育机构：马士兵教育
# 讲    师：杨淑娟

results1=zip([[0],[1]],[[00],[11]],[[000],[111]])
print(list(results1))
results2=zip([['a',0],[000]],[['b',11],[111]],[['c',22],[222]])
print(list(results2))
results3=zip([['a',0],[000],['俺是第一个']],[['b',11],[111],['俺是第二个']],[['c',22],[222],['俺是第三个']])
print(list(results3))
results4=zip([['a',00],[000],['俺是第一个'],['结束啦1']],
            [['b',11],[111],['俺是第二个'],['结束啦2']],
            [['c',22],[222],['俺是第三个'],['结束啦3']],
            [['第四列来了']])
print(list(results4))
results5=zip([['a',00],[000],['俺是第一个'],['结束啦1']],
             [['b',11],[111],['俺是第二个'],['结束啦2']],
             [['c',22],[222],['俺是第三个'],['结束啦3']])
print(list(results5))

print('字典遍历的是什么') # 字典遍历的是key
lst=[11,22,33,44]
d={1:'a',2:'b',3:'c',4:'d'}
rs=zip(lst,d)
print(list(rs))