# 教育机构：马士兵教育
# 讲    师：杨淑娟

# 字典d中存储了我国42所双一流高校及所在省份的对应关系，请你以这个字典为数据变量，
# 编写Python代码，统计各省份学校的数量。    字符串是最后一个\表示的是续行符，\之后不允许有任何符号
d={"北京大学":"北京","中国人民大学":"北京","清华大学":"北京","北京航空航天大学":"北京",\
   "北京理工大学":"北京","中国农业大学":"北京","北京师范大学":"北京","中央民族大学":"北京",\
   "南开大学":"天津","天津大学":"天津","大连理工大学":"辽宁","吉林大学":"吉林","哈尔滨工业大学":"黑龙江",\
   "复旦大学":"上海","同济大学":"上海","上海交通大学":"上海","华东师范大学":"上海","南京大学":"江苏",\
   "东南大学":"江苏","浙江大学":"浙江","中国科学科技大学":"安徽","厦门大学":"福建","山东大学":"山东",\
   "中国海洋大学":"山东","武汉大学":"湖北","华中科技大学":"湖北","中南大学":"湖南","中山大学":"广东",\
   "华南理工大学":"广东","四川大学":"四川","电子科技大学":"四川","重庆大学":"重庆","西安交通大学":"陕西",\
   "西北工业大学":"陕西","兰州大学":"甘肃","国防科技大学":"湖南","东北大学":"辽宁","郑州大学":"河南",\
   "湖南大学":"湖南","云南大学":"云南","西北农林科技大学":"陕西","新疆大学":"新疆"}

# 要统计各省份的学校数量？跟值有关还是跟键有关？根值有关
lst=list(d.values()) # 将字典中的所有值转成列表对象
print(lst) # 转成了列表对象，只需要统计城市 名称的个数，可以使用字典，key是城市名称，值是数量
newd={}  # 一个新的字典，使用这个新字典存储城市 和城市大学的数量
for city in lst:
    newd[city]=newd.get(city,0)+1  # 先执行右侧， 字典的取值，如果键不存在，使用默认值 0

for item in newd:
    print('{}:{}'.format(item,newd[item]))
